even after nullifying everything that conflicts, engine is set to redis instead of valkey

```hcl
  # Fixes
  engine                      = null
  security_group_names        = null
  transit_encryption_enabled  = null
  at_rest_encryption_enabled  = null
  snapshot_arns               = null
```

```hcl
  # module.elasticache-us-west-2["maldo"].aws_elasticache_replication_group.this[0] will be created
  + resource "aws_elasticache_replication_group" "this" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Replication group"
      + engine                         = "redis"
      + engine_version                 = (known after apply)
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = "ldgnf-maldo"
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = (known after apply)
      + node_type                      = (known after apply)
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = (known after apply)
      + parameter_group_name           = (known after apply)
      + port                           = 6379
      + preferred_cache_cluster_azs    = []
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + region                         = "us-west-2"
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "maldo"
      + security_group_ids             = [
          + "sg-0f40b50581797dc68",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "maldo"
      + tags                           = {
          + "Name"                  = "maldo"
          + "environment"           = "stage"
          + "managed_by"            = "terraform"
          + "service"               = "maldo"
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all                       = {
          + "Name"                  = "maldo"
          + "environment"           = "stage"
          + "managed_by"            = "terraform"
          + "service"               = "maldo"
          + "terraform-aws-modules" = "elasticache"
        }
      + transit_encryption_enabled     = (known after apply)
      + transit_encryption_mode        = (known after apply)
    }
```

so I don't think this is going to work even if I set everything right.

you may be affected by this bug: https://github.com/hashicorp/terraform-provider-aws/issues/41713